логин: vladimir.lyz
пароль: IntelCoreI27
пароль: IntelCoreI28
пароль: IntelCoreI29
пароль: IntelCoreI30
IntelCoreI31
IntelCoreI32
IntelCoreI33

///////////////////////////////////////////////////////////////
SoM
 PCL-063-23300CI.A4
 PCL_063_KSP_RIMERA_A0
пароль: IntelCoreI31

///////////////////////////////////////////////////////////////
Алексей Хомутов
Антон Ильин
///////////////////////////////////////////////////////////////

Отчёт за 2-6 сентября 2019г
1. Восстановление рабочего окружения linux - 100%. Затрачено 2*8=16 часов.
2. Восстановление рабочего окружения windows - 10%. -
3. Разработка скриптов "восстановления/установки системного ПО на внутреннюю память SoM" - 90%.
   Затрачено 3*8=24 часа.

Замечания к ПО КСУ:
1. При аварии по высокому напряжению сети (в КИ) в аварийный контекст укладываются 3 фазных напряжения.
   Римера показывает напряжения Uab, Ubc, Uca.
2. Режим роснефти "прокачка газа". Нужно сделать Fmin и Fmax настраиваемыми относительно текущей заданной частоты.
3. Срабатывает перевод часов лето/зима. Надо проверить правильность.
4. Алгоритм встряхивания. Если во время встряхивания изменить частоту, то алгоритм зависает в ожидании 
   перехода на частоту встряхивания. Необходимо блокировать во время действия алгоритма пропускание команды
   изменения частоты.
5. Ручной режим. При срабатывании защиты не входит в блокировку. Нужно в ручной режим подставить состояние ПЭД.

Отчёт за 6-10 апреля 2020г
1. Рефакторинг журнала событий. 

env WINEPREFIX="/home/lyzv/.wine" wine C:\\windows\\command\\start.exe /Unix /home/lyzv/.wine/dosdevices/c:/users/Public/Desktop/Modbus\ Poll.lnk


Modbus Slave:
env WINEPREFIX="/home/lyzv/.wine" wine C:\\windows\\command\\start.exe /Unix /home/lyzv/.wine/dosdevices/c:/users/Public/Desktop/Modbus\ Slave.lnk

dmitry@sent.com


"Пункт 2.3.2. Пункт 2.3.2. Перед запросом данных файла журнала событий СУ система телемеханики
запрашивает идентификационную информацию (ID 0x80 – 0x84). Если значение
поля «ID 0x84» содержит информацию отличную от нуля, то файл журнала
событий готов к считыванию системой телемеханики. При нулевом значении поля
«ID 0x84» система телемеханики продолжает запрос идентификационной
информации (ID 0x80 – 0x84) до изменения значения поля «ID 0x84»."



>><<--------------------------------------------------------------------------->><<
11:02:43  
11:02:43  Начало процесса ReadDeviceIdentification - чтение идентификационной информации устройства.
11:02:43  
11:02:43  Ожидается получение следюущих объектов от устройства:
11:02:43  0x00 (ASCII)
11:02:43  
11:02:43  Обращение к устройству.
11:02:43  
11:02:43  Обращение к устройству, попытка=1
11:02:43  
11:02:43  Попытка подключения к устройству с COM-портом=COM3,9600,8,None,One
11:02:44  Попытка подключения, результат=True
11:02:44  
11:02:44  Попытка опроса устройства командой=43 (0x2B), таймаут Request=3000мс., таймаут Response=3000мс.
11:02:44  
11:02:44  Итоговый результат попытки обращения к устройству:
11:02:44  Запрос:
11:02:44  >>> 


Запрос:
01.
2B.Function code
0E.MEI Type
01.Read Device ID code - request to get the basic device identification (stream access) Потоковый доступ!
00.Object Id - потоковый доступ к базовым идентификационным объектам, начиная с объекта №0 (VendorName)

70.77 CRC16 

Ответ:
01.
2B.Function code
0E.MEI Type
01.Read Device ID code
81.Conformity level
00.More Follows
00.Next Object Id
03.Number of objects

00.Object ID -   VendorName - "INM"
03.Object length
49. 'I'
4E. 'N'
4D. 'M'

01.Object ID -   ProductCode - "INM-3"
05.Object length
49. 'I'
4E. 'N'
4D. 'M'
2D. '-'
33. '3'

02.Object ID - MajorMinorRevision - "13.1.1911"
09.Object length
31. '1'
33. '3'
2E. '.'
31. '1'
2E. '.'
31. '1'
39. '9'
31. '1'
31. '1'

00.7E CRC16 



(Response 33 байт, Timestamp 11:02:44.315/637279885643158422)
11:02:44  Результат: Successful=True, NumberTry=1, TicksRequestResponse=1406250
11:02:44  Попытка опроса устройства командой=43 (0x2B) завершена успешно.
11:02:44  В ответе обнаружено объектов=3
11:02:44  Все ожидаемые объекты были обнаружены в ответе.
11:02:44  
11:02:44  Отключение от устройства с COM-портом=COM3
11:02:44  
11:02:44  Обращение к устройству завершено.
11:02:44  
11:02:44  Значения полученных объектов:
11:02:44  ControllerSoftVersion=INMINM-313.1.1911
11:02:44  
11:02:44  За весь процесс было совершено неудачных попыток обращений к устройству=0
11:02:44  Процесс ReadDeviceIdentification - чтение идентификационной информации устройства завершен, затрачено=0,51 секунд.


extern IMBSHoldingRegister *MBS_GSuState                ;//0x00. Состояние СУ
extern IMBSHoldingRegister *MBS_GReasonsForStart1       ;//0x01. Причины мешающие запуску СУ. Регистр 1
extern IMBSHoldingRegister *MBS_GReasonsForStart2       ;//0x02. Причины мешающие запуску СУ. Регистр 2
extern IMBSHoldingRegister *MBS_GReasonsForStart3       ;//0x03. Причины мешающие запуску СУ. Регистр 3
extern IMBSHoldingRegister *MBS_GReasonsForStart4       ;//0x04. Причины мешающие запуску СУ. Регистр 4
extern IMBSHoldingRegister *MBS_GUab                    ;//0x05. Напряжение сети AB
extern IMBSHoldingRegister *MBS_GUbc                    ;//0x06. Напряжение сети BC
extern IMBSHoldingRegister *MBS_GUca                    ;//0x07. Напряжение сети CA
extern IMBSHoldingRegister *MBS_GUUnb                   ;//0x08. Дисбаланс напряжения сети
extern IMBSHoldingRegister *MBS_GIa_motor               ;//0x09. Ток двигателя, фаза A
extern IMBSHoldingRegister *MBS_GIb_motor               ;//0x0A. Ток двигателя, фаза B
extern IMBSHoldingRegister *MBS_GIc_motor               ;//0x0B. Ток двигателя, фаза C
extern IMBSHoldingRegister *MBS_GIUnb                   ;//0x0C. Дисбаланс тока двигателя
extern IMBSHoldingRegister *MBS_GPwr                    ;//0x0D. Активная мощность
extern IMBSHoldingRegister *MBS_GSPwr                   ;//0x0E. Полная мощность
extern IMBSHoldingRegister *MBS_GCos                    ;//0x0F. Коэффициент мощности
extern IMBSHoldingRegister *MBS_GMotorLoading           ;//0x10. Загрузка
extern IMBSHoldingRegister *MBS_GRiz                    ;//0x11. Сопротивление изоляции

extern IMBSHoldingRegister *MBS_GReversAvers            ;//0x50. Направление вращения
extern IMBSHoldingRegister *MBS_GWpedRpm                ;//0x51. Частота вращения об/мин.
extern IMBSHoldingRegister *MBS_GFout                   ;//0x52. Выходная частота ПЧ

extern IMBSHoldingRegister *MBS_GWorkMode               ;//0x80. Режим работы: 0 - откл; 1 - ручной; 2 - автоматический
extern IMBSHoldingRegister *MBS_GUPowerNom              ;//0x81. Номинальное напряжение сети


01 Device Address 
03 Function code
24 Byte count

50 00 
00 00 
00 00 
00 00 
00 00 
00 D3 
00 01 
00 D3 
00 25 
00 00 
00 00 
00 00 
00 00 
00 00 
00 00 
00 00 
00 00 
00 00 - 36 байт 

5A 15

_SeqPhaseEnable

Cross compile rasperrypi:
https://www.raspberrypi.org/documentation/linux/kernel/building.md


git clone git://code.qt.io/qt/qt5.git Qt57Sources

 Заявление измени гл. бух на Козявину Т.П.
Приложи чек
Приложи банковскую выписку
Всё это отправь ГБ, копия Гайнуллиной А.Р.

Алексей Сергеевич, здравствуйте.


Мой отпуск выпал на "период короновируса". Прошу согласовать перенос отпуска на сентябрь.

make-ksu-firmware ksu -d 2 -v 13.1.18 -z 1 -f 200 -q 1000

Удалённые:

IndexUFreqNom
NT_IndexLenCable
IndexDI4
IndexKTM_DI4
FN_IndexOverIBypassDelay_forML
FN_IndexOverIOffDelay_forML
FN_IndexOverUEnable_forML
FN_IndexOverUOffDelay_forML
FN_IndexUnderUEnable_forML
FN_IndexUnderUOffDelay_forML
